Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеквизитыКонтрагента</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПоступлениеНаРасчетныйСчет/Forms/ФормаДокументаОднострочная/Ext/Form/Module.bsl
//ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
//получение настроек пользователя, по заданному ключу
&НаСервере
Функция ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку(Ключ,ПоУмолчанию);	
КонецФункции

Функция ПолучитьИННОрганизации(Организация)
	Возврат Организация.ИНН;
КонецФункции

&НаСервере
Функция ПолучитьЗаявку(Знач НомерЗаявки)
	КВозврату = Новый Структура;
	Префикс = СокрЛП(ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс","ЭТ18-")); 
	СтрокаПоиска = ВРег(СокрЛП(ЭтаФорма.СтрокаПоиска)); 
	Если СтрНайти(СтрокаПоиска,ВРег(Префикс))=0 Тогда
		СтрокаПоиска = Префикс + Формат(СтрокаПоиска,"ЧРД=; ЧРГ=; ЧГ=");
	КонецЕсли;
	НомерЗаявки = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(СтрокаПоиска,Префикс);
	КВозврату = ЭТ_ОбщийМодуль2.ПолучитьЗаявкуПоНомеру(НомерЗаявки);
	Возврат  КВозврату;
КонецФункции

//ЭТ_ЗаполнитьСБВместо(Команда)
//Заполняет документ созласно данным СБ
//получаем введенную пользователем строку, разбираем ее на префикс и номер, пытаемся найти заявку с указанным номером в СБ
//передаем данные в процедуру ЗаполнитьФормуПРС для непосредственного заполнения
&НаКлиенте
Процедура ЭТ_ЗаполнитьСБВместо(Команда)    
	ЭтаФорма.СтрокаПоиска = СтрЗаменить(ЭтаФорма.СтрокаПоиска," ","");
	СледЗаявка =  ПолучитьЗаявку(ЭтаФорма.СтрокаПоиска);
	//Проверяем наличие договора
	Если СледЗаявка.Свойство("id_internal") Тогда
		НайденДоговор = НайтиДоговорПокупателя(СледЗаявка.id_internal,Ложь);
		Если НЕ НайденДоговор = Ложь Тогда
			Контрагент = ПолучитьКонтрагентаПоДоговору(НайденДоговор);
			РасшифровкаПлатежаДоговорКонтрагента=НайденДоговор;
		Иначе
			СозданДоговор = СоздатьДоговорПокупателя(СледЗаявка);
			Контрагент = ПолучитьКонтрагентаПоДоговору(СозданДоговор);
			//Сообщить(Контрагент);
			РасшифровкаПлатежаДоговорКонтрагента=СозданДоговор;
		КонецЕсли;  
		Если СледЗаявка.supplier_inn = ПолучитьИННОрганизации(Объект.Организация) Тогда
			ОтражениеАванса = ПолучитьНастройку("ОтражениеАвансаПоставщики","Доход УСН"); //"Доход УСН";             
			Сообщить("Наша компания является туроператором");
			//ПоказатьПредупреждение(,"Наша компания является туроператором",,"Предупреждение");
		Иначе
			ОтражениеАванса = ПолучитьНастройку("ОтражениеАвансаАгенты","Доход комитента"); //"Доход комитента";
		КонецЕсли;										
		ЗаполнитьФормуПРС(Новый Структура("Контрагент, РасшифровкаПлатежаДоговорКонтрагента",Контрагент, РасшифровкаПлатежаДоговорКонтрагента));
		РасшифровкаПлатежаОтражениеАвансаПредставление = ОтражениеАванса;										
	КонецЕсли;
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = Ложь;
	ТекущийЭлемент = ЭтаФорма.Элементы.СуммаДокумента;	
КонецПроцедуры

//ПолучитьМассивЗаявок(Параметры)
//на основании присланных данных производит поиск заявок в СБ
&НаСервере
Функция ПолучитьМассивЗаявок(Параметры)
	Возврат ЭТ_ОбщийМодуль2.RequestSearch(Параметры);	
КонецФункции

//ПолучитьКонтрагентаПоДоговору(Договор)
//по номеру договора получает контрагента
&НаСервере
Функция ПолучитьКонтрагентаПоДоговору(Договор)
	Возврат Договор.Владелец;
КонецФункции


//СоздатьДоговорПокупателя(Заявка)
//Проверяет наличие договора покупателя, если такого нет, то создает договор
//возвращает ссылку на договор с покупателем
&НаСервере
Функция СоздатьДоговорПокупателя(Заявка)
	Заказчик = ЭТ_ОбщийМодуль2.User(Новый Структура("id",Заявка.client_id));
	Контрагент = ВернутьКонтрагентаПоЗаявке(Заявка);
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование
		|ИЗ 
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И (
		|		ДоговорыКонтрагентов.Номер = &НомерЗаявки
		|		ИЛИ ДоговорыКонтрагентов.Наименование ПОДОБНО &НомерЗаявкиЧасть
		|	)
		|"); 
	Запрос.УстановитьПараметр("Контрагент", Контрагент.Ссылка);	
	Запрос.УстановитьПараметр("НомерЗаявки", СокрЛП(Заявка.id_internal));
	Запрос.УстановитьПараметр("НомерЗаявкиЧасть", "%"+СокрЛП(Заявка.id_internal)+"%");
	Результат = Запрос.Выполнить().Выбрать();
	НайденДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Пока Результат.Следующий() Цикл 
		НайденДоговор = Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Если НайденДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		НайденДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();		
		НайденДоговор.Владелец = Контрагент.Ссылка;
		НайденДоговор.Номер = СокрЛП(Заявка.id_internal);
		ДатаЗ = Заявка.dat;
		НайденДоговор.Дата = ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВДату(ДатаЗ);
		ДатаЗ = Заявка.dat;
		НайденДоговор.Наименование = СокрЛП(Заявка.id_internal)+" от "+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(ДатаЗ);
		ВидДоговора = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент");
		НайденДоговор.ВидДоговора = ВидДоговора;
		НайденДоговор.Организация = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация");
		НайденДоговор.ВалютаВзаиморасчетов = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВалютаДокументов1С");
		НайденДоговор.Записать();
	КонецЕсли;
	Возврат НайденДоговор.Ссылка;
КонецФункции

//ЗаполнитьФормуПРС(Парам)
//на основании присланных данных заполняет форму документа
&НаСервере
Процедура ЗаполнитьФормуПРС(Парам)
	Объект.Контрагент = Парам.Контрагент;
	ЭтаФорма.РасшифровкаПлатежаДоговорКонтрагента = Парам.РасшифровкаПлатежаДоговорКонтрагента;
	Объект.НазначениеПлатежа = "Оплата по договору " + Парам.РасшифровкаПлатежаДоговорКонтрагента;
КонецПроцедуры


//ВернутьКонтрагентаПоЗаявке(Заявка)
//По присланной заявке СБ, возвращает ссылку на контрагента в 1С
//сравнение происходит следующим образом:
// - ИНН
// - Номер паспорта
// - Наименование
//все условия равнозначны, используется ИЛИ
//в случае, если контрагент не найден, он будет создан
&НаСервере
Функция ВернутьКонтрагентаПоЗаявке(Заявка)
	//Получаем заявку
	Заказчик = ЭТ_ОбщийМодуль2.User(Новый Структура("id",Заявка.client_id));
	//Запрос = Новый Запрос(" 
	//	|ВЫБРАТЬ 
	//	|	Ссылка, 
	//	|	Наименование
	//	|ИЗ 
	//	|	Справочник.Контрагенты КАК Контрагенты
	//	|ГДЕ
	//	|	(Контрагенты.ИНН = &ИНН И Контрагенты.ИНН<>"""")
	//	|	ИЛИ (ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ПаспортПолный И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>"""")
	//	|	ИЛИ ((Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортПолный ИЛИ Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортНомер) И (Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортДата) И Контрагенты.ДокументУдостоверяющийЛичность<>"""")
	//	|	ИЛИ (Контрагенты.НаименованиеПолное ПОДОБНО &Фамилия И Контрагенты.НаименованиеПолное ПОДОБНО &Имя И Контрагенты.НаименованиеПолное ПОДОБНО &Отчество И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ДатаРождения И Контрагенты.НаименованиеПолное<>"""" И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>"""")
	//	|"); 
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование
		|ИЗ 
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(Контрагенты.ИНН = &ИНН И &ЗаполненИНН=Истина)
		|	ИЛИ (
		|		(Контрагенты.НаименованиеПолное ПОДОБНО &Фамилия И &ЗаполненФамилия=Истина)
		|		И (Контрагенты.НаименованиеПолное ПОДОБНО &Имя И &ЗаполненИмя=Истина)
		|		И ((Контрагенты.НаименованиеПолное ПОДОБНО &Отчество И &ЗаполненОтчество=Истина) ИЛИ &ЗаполненОтчество=Ложь)
		|	)
		|"); 
	Запрос.УстановитьПараметр("ЗаполненИНН", СтрДлина(СокрЛП(Заказчик.u_inn))>0);	
	Запрос.УстановитьПараметр("ИНН", СокрЛП(Заказчик.u_inn));	
	//Запрос.УстановитьПараметр("ПаспортПолный", "%"+Заказчик.u_passport_number+"%");
	//Запрос.УстановитьПараметр("ПаспортНомер", "%"+Прав(Заказчик.u_passport_number,6)+"%");
	//Запрос.УстановитьПараметр("ПаспортДата", "%"+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_passport_date)+"%");
	Запрос.УстановитьПараметр("Фамилия", "%"+Заказчик.u_surname+"%");
	Запрос.УстановитьПараметр("Имя", "%"+Заказчик.u_name+"%");
	Запрос.УстановитьПараметр("Отчество", "%"+Заказчик.u_sname+"%");

	Запрос.УстановитьПараметр("ЗаполненФамилия", СтрДлина(СокрЛП(Заказчик.u_surname))>0);
	Запрос.УстановитьПараметр("ЗаполненИмя", СтрДлина(СокрЛП(Заказчик.u_name))>0);
	Запрос.УстановитьПараметр("ЗаполненОтчество", СтрДлина(СокрЛП(Заказчик.u_sname))>0);
	
	//Запрос.УстановитьПараметр("ДатаРождения", ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday));
	Результат = Запрос.Выполнить().Выбрать();
	НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка();	
	Пока Результат.Следующий() Цикл 
		НайденКонтрагент = Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Если НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		НайденКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		//Физик или Юрик
		Если СтрДлина(СокрЛП(Заказчик.u_company))>0 Тогда
			//заполняем юрика
			НайденКонтрагент.Наименование = Заказчик.u_company;
			НайденКонтрагент.НаименованиеПолное = Заказчик.u_company;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			НайденКонтрагент.ИНН =  Заказчик.u_inn;			
		Иначе
			//заполняем физика
			НайденКонтрагент.Наименование = Заказчик.u_surname+" "+Заказчик.u_name+" "+Заказчик.u_sname;
			НайденКонтрагент.НаименованиеПолное = Заказчик.u_surname+" "+Заказчик.u_name+" "+Заказчик.u_sname;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			НайденКонтрагент.ИНН =  Заказчик.u_inn;
			Паспорт = "";
			Если СтрДлина(Заказчик.u_passport_number)>0 Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+Заказчик.u_passport_number;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_taken)>0 Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+"выдан "+Заказчик.u_passport_taken;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_date)>0 Тогда 				
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;
				Паспорт = Паспорт+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_passport_date);
			КонецЕсли;
			Если СтрДлина(Паспорт)>0 Тогда 
				НайденКонтрагент.ДокументУдостоверяющийЛичность = Паспорт;
			КонецЕсли;
			ДатаРождения = "";			
			Если СтрДлина(Заказчик.u_birthday)>0 Тогда 
				ДатаРождения = ДатаРождения+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday);
			КонецЕсли;
			НайденКонтрагент.Комментарий = "";
			Если СтрДлина(Паспорт)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+Паспорт; КонецЕсли;
			Если СтрДлина(ДатаРождения)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" д.р. "+ДатаРождения; КонецЕсли;
		КонецЕсли;
		НайденКонтрагент.ДополнительнаяИнформация = "";
		Если СтрДлина(Заказчик.address)>0 Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Адрес: "+Заказчик.address;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.Представление = СокрЛП(Заказчик.address);				
		КонецЕсли;
		Если СтрДлина(Заказчик.u_phone_mobile)>0 ИЛИ СтрДлина(Заказчик.u_phone)>0 Тогда
			Телефоны = Новый Массив(2);
			СчетМассив = 0;
			Если СтрДлина(Заказчик.u_phone_mobile)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone_mobile;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_phone)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone;
			КонецЕсли;				
			Если Телефоны.Количество()>0 Тогда
				Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
				НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Телефоны: "+СокрЛП(СтрСоединить(Телефоны,", "));					
				НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
				НоваяСтрока.Представление = СокрЛП(СтрСоединить(Телефоны,", "));
				НоваяСтрока.НомерТелефона = Телефоны[0];
			КонецЕсли;				
		КонецЕсли;
		Если СтрДлина(Заказчик.u_email)>0 Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Эл.почта: "+Заказчик.u_email;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.АдресЭП = Заказчик.u_email;
			НоваяСтрока.Представление = СокрЛП(Заказчик.u_email);			
		КонецЕсли;
		КаталогЗаказчиков = ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогЗаказчиков");
		НайденКонтрагент.Родитель = КаталогЗаказчиков;
		НайденКонтрагент.Записать();
	КонецЕсли;
	Возврат НайденКонтрагент;
КонецФункции

//ПолучитьДанныеЗаявки(СледЗаявкаНомер)
//получает данные заявки из СБ, по переданному номеру
&НаСервере
Функция ПолучитьДанныеЗаявки(СледЗаявкаНомер)
	Возврат ЭТ_ОбщийМодуль2.Request(Новый Структура("id",СледЗаявкаНомер));
КонецФункции

//НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
//Осуществлет поиск договора покупателя в 1С по переданному номеру заявки
//новый договор не создает
&НаСервере
Функция НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
	ВидДоговораКлиент = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент");
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование 
		|ИЗ 
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Номер = &НомерДоговора
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора 
		|"); 
	Запрос.УстановитьПараметр("НомерДоговора", НомерЗаявки);	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговораКлиент);		
	Результат = Запрос.Выполнить().Выбрать(); 
	Пока Результат.Следующий() Цикл 		
		Возврат Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Возврат ПоУмолчанию;
КонецФункции

//ЭТ_ЗаполнитьНаОснованииСБВместо(Команда)
//Управляет видимостью панели заполнения на основании СБ
&НаКлиенте
Процедура ЭТ_ЗаполнитьНаОснованииСБВместо(Команда)
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = НЕ ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость;
КонецПроцедуры


//ЭТ_СнятьПроведениеДокумента()
//При отмене проведения удаляем документ из СБ
&НаСервере
Процедура ЭТ_СнятьПроведениеДокумента()
		//Сообщить("Для корректного изменения снято проведение документа. Повторите пожалуйста выбор договора.");		
		//Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
КонецПроцедуры

//ЭТ_ДоговорКонтрагентаПриИзмененииПеред(Элемент)
//Перед началом изменений, необходимо снять проведение документа
&НаКлиенте
Процедура ЭТ_ДоговорКонтрагентаПриИзмененииПеред(Элемент)
	//Если Объект.Проведен Тогда	ЭТ_СнятьПроведениеДокумента();	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтоНовыйОбъект()
	Возврат Объект.Ссылка.Пустая();
КонецФункции

&НаКлиенте
Процедура ЭТ_ПриОткрытииПосле(Отказ)
	ЭтотОбъект.Элементы.ФормаОткрытьФормуЮОН.Видимость = Истина;
	//ФормаОткрытьФормуЮОН
	Если ЭтоНовыйОбъект() Тогда
		РасшифровкаПлатежаОтражениеАвансаПредставление = "Доход комитента";
	КонецЕсли;	
КонецПроцедуры
